In [1]:
import numpy as np
# numpy 的升级版
import pandas as pd

In [2]:
# dir(pd) #查看库

# 一、Series 对象
- 类似于一维数组,但有索引

In [3]:
a = pd.Series([1,2,3])
a

0    1
1    2
2    3
dtype: int64

In [4]:
a.dtype

dtype('int64')

In [5]:
b=pd.Series(['1','a',3])
b.dtype

dtype('O')

In [6]:
# help(pd.Series) #查看Series对象

- ## 1.切片

In [7]:
# 切取索引号为2的元素
a[2]

3

In [8]:
c=pd.Series(range(20))
c

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int64

In [9]:
# 索引
c[::5]

0      0
5      5
10    10
15    15
dtype: int64

In [10]:
d=pd.Series(range(4),index=list('abcd'))
d

a    0
b    1
c    2
d    3
dtype: int64

In [11]:
e=pd.Series(range(4),index=['e','f','g','h'])
e

e    0
f    1
g    2
h    3
dtype: int64

In [12]:
e['g']

2

In [13]:
e[2]
# 既可以索引索引号、也可以索引数字

2

In [14]:
e['e':'g']

e    0
f    1
g    2
dtype: int64

- ## 2.布尔索引

In [15]:
a

0    1
1    2
2    3
dtype: int64

In [16]:
a > 2

0    False
1    False
2     True
dtype: bool

In [17]:
a[a>2]

2    3
dtype: int64

- ## 3.运算 +

In [18]:
# f=pd.Series(np.random.uniform(1,2,(2,3)))
# f
# 报错  Series对象必须是一维的

In [19]:
f1=pd.Series(np.random.uniform(1,2,6))
f1

0    1.072339
1    1.768770
2    1.339811
3    1.372339
4    1.479988
5    1.184520
dtype: float64

In [20]:
# 每个元素都加1
f1+1

0    2.072339
1    2.768770
2    2.339811
3    2.372339
4    2.479988
5    2.184520
dtype: float64

In [21]:
# 报错 加法运算要求必须是相同的类型
# f1+'1'

In [22]:
# 查看变量的用法(有哪些可用的函数)
# dir(a)

- ## 4.类型转换 astype

In [23]:
# 正常情况下
series = pd.Series(np.arange(10))
series

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [24]:
series1=series.astype(str)
# type(series)
# series1.dtype
series1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: object

In [25]:
# 特殊情况下
series2=pd.Series(['1',2,'a'])
# series2.astype(float)
# a 无法转换成float

- astype中的参数 error参数 
    - raise 转化过程出错，会报错
    - ignore 转化过程出错，会忽略错误

- ## 5.类型转换  pd.to_numeric方法
- 转换成数字

In [26]:
# pd.to_numeric('w',errors='raise')  #报错 
pd.to_numeric('w',errors='ignore')  #忽略错误 输出原始元素

'w'

- ## 6.map方法
- map常与lambda连用

In [27]:
series3=pd.Series([4,5,6])
series3.map(lambda x:x+1)

0    5
1    6
2    7
dtype: int64

# 二、DataFrame 数据框 对象

- ### 1.**生成方式**
    - 手动生成
    - 导入外部数据 pd.read_csv pd.read_excel

In [28]:
import numpy as np
import pandas as pd

In [29]:
data=pd.DataFrame(np.random.rand(5,6),index=list('abcde'),columns=list(range(6)))
data

          0         1         2         3         4         5
a  0.759781  0.488430  0.342289  0.854425  0.524565  0.368933
b  0.392583  0.389038  0.525776  0.182466  0.470219  0.700533
c  0.736589  0.927081  0.511627  0.556415  0.621876  0.788444
d  0.683362  0.696515  0.497332  0.527797  0.755113  0.236949
e  0.059952  0.501941  0.748789  0.236910  0.916829  0.143091

- ### 2.查看基本信息

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 6 columns):
0    5 non-null float64
1    5 non-null float64
2    5 non-null float64
3    5 non-null float64
4    5 non-null float64
5    5 non-null float64
dtypes: float64(6)
memory usage: 280.0+ bytes

- ### 3.查看前后几条信息（head、tail）

In [31]:
data.head(2)
# 不填默认的显示5行

          0         1         2         3         4         5
a  0.759781  0.488430  0.342289  0.854425  0.524565  0.368933
b  0.392583  0.389038  0.525776  0.182466  0.470219  0.700533

In [32]:
data.tail(2)

          0         1         2         3         4         5
d  0.683362  0.696515  0.497332  0.527797  0.755113  0.236949
e  0.059952  0.501941  0.748789  0.236910  0.916829  0.143091

- ## 4.**查看数据框属性**
    - ##   shape
    - ##   values
    - ##   columns
    - ##   index

In [33]:
data.shape

(5, 6)

In [34]:
# 查看所有值，数组的形式返回。
data.values

array([[0.75978069, 0.48842976, 0.34228896, 0.85442512, 0.52456502,
        0.36893259],
       [0.3925832 , 0.38903786, 0.52577619, 0.18246562, 0.47021895,
        0.70053337],
       [0.73658887, 0.92708134, 0.51162656, 0.55641528, 0.62187567,
        0.78844358],
       [0.68336178, 0.69651501, 0.49733188, 0.52779697, 0.75511274,
        0.23694883],
       [0.05995228, 0.50194138, 0.74878917, 0.23690971, 0.91682914,
        0.14309096]])

In [35]:
data.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [36]:
data.columns

Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')

 - ## 5.转置 T

In [37]:
data.T

          a         b         c         d         e
0  0.759781  0.392583  0.736589  0.683362  0.059952
1  0.488430  0.389038  0.927081  0.696515  0.501941
2  0.342289  0.525776  0.511627  0.497332  0.748789
3  0.854425  0.182466  0.556415  0.527797  0.236910
4  0.524565  0.470219  0.621876  0.755113  0.916829
5  0.368933  0.700533  0.788444  0.236949  0.143091

- ## 6.**索引、切片**

- ## ***索引行 [,]***
   - 索引一行
   - 索引几行

- ##### 索引一列

In [38]:
data[1]

a    0.488430
b    0.389038
c    0.927081
d    0.696515
e    0.501941
Name: 1, dtype: float64

- ##### 索引几列

In [39]:
data[[1,3]]

          1         3
a  0.488430  0.854425
b  0.389038  0.182466
c  0.927081  0.556415
d  0.696515  0.527797
e  0.501941  0.236910

- ## ***索取的行  [:]***

In [40]:
data[0:1]

          0        1         2         3         4         5
a  0.759781  0.48843  0.342289  0.854425  0.524565  0.368933

In [41]:
data[1:3]

          0         1         2         3         4         5
b  0.392583  0.389038  0.525776  0.182466  0.470219  0.700533
c  0.736589  0.927081  0.511627  0.556415  0.621876  0.788444

- #### 注意：切取第0行时要写成[0:0]，不然的话会报错

In [42]:
data[0:0]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5]
Index: []

- ## 特有的索引、切片方式  [行,列]
    - loc 显示索引   data.loc[索引行,索引列]   
        - 使用显示索引时,连续索引时的冒号的右侧的列或行是包含的
        - 查看loc用法   
            * help(data.loc)
            * np.info(data.loc)
            * data.loc?
    - iloc 隐式索引  语法同上
      -   连续索引时的冒号的右侧是不包括的
    - ix  混合索引    现已被弃用

In [43]:
data.loc['a']

0    0.759781
1    0.488430
2    0.342289
3    0.854425
4    0.524565
5    0.368933
Name: a, dtype: float64

In [44]:
# 行列显示的连续索引
data.loc['a':'c',1:3]

          1         2         3
a  0.488430  0.342289  0.854425
b  0.389038  0.525776  0.182466
c  0.927081  0.511627  0.556415

In [45]:
data.loc[['a','b','c'],1:3]

          1         2         3
a  0.488430  0.342289  0.854425
b  0.389038  0.525776  0.182466
c  0.927081  0.511627  0.556415

In [46]:
# 行列显示的不连续索引
data.loc[['a','c'],[1,3]]

          1         3
a  0.488430  0.854425
c  0.927081  0.556415

- 隐式索引

In [47]:
# 隐形索引索取连续的行列
data.iloc[1:3,1:3]

          1         2
b  0.389038  0.525776
c  0.927081  0.511627

In [48]:
# 隐式索取不连续的行列
data.iloc[[1,3],[1,2]]

          1         2
b  0.389038  0.525776
d  0.696515  0.497332

- ## 7.布尔索引

In [61]:
np.random.seed(0)
data1=pd.DataFrame(np.random.randint(10,100,(4,3)),index=list('abcd'),columns=['x1','x2','x3'])
data1

   x1  x2  x3
a  54  57  74
b  77  77  19
c  93  31  46
d  97  80  98

In [62]:
# 选出x1列中大于70的数值
data1.x1[data1['x1']>70]

b    77
c    93
d    97
Name: x1, dtype: int32

In [63]:
# 选出x1列中大于70小于90的数值
'''注意若有多个条件，每个条件要用括号括起来'''
data1.x1[(data1['x1']>70) & (data1['x1'] <90)]

b    77
Name: x1, dtype: int32

- ## 8.删除一列

- **删除**
    - pop   直接删除
    - drop  
        - 参数 inplace=True直接作用数据上
        - axis=1 列
        - axis=0 行

In [64]:
data1.pop('x1')

a    54
b    77
c    93
d    97
Name: x1, dtype: int32

In [ ]:
# data1.pop(['x4'])
# 报错 x4不在数据框中

In [65]:
data1.drop(['x2'],axis=1, #删除整列
#            inplace=True #直接作用在数据上
          )
data1

   x2  x3
a  57  74
b  77  19
c  31  46
d  80  98

In [57]:
# 删除行
data1.drop(['d'],axis=0)

   x2  x3
a  57  74
b  77  19
c  31  46

In [66]:
data1.drop(['d'],axis=0,inplace=True)

In [67]:
data1

   x2  x3
a  57  74
b  77  19
c  31  46

In [69]:
data1.drop(['x3'],axis=1,inplace=True)
data1

   x2
a  57
b  77
c  31

In [74]:
# data1.drop(['x4'],axis=1)
# 不存在x4会报错

In [75]:
# 参数errors='ignore' 忽略错误  'raise'有错误就报错并停止向下运行
data1.drop(['x4'],axis=1,errors='ignore')

   x2
a  57
b  77
c  31

- ## 9.新增一列

- ### 新增常数列

In [76]:
data1['x4']=100

In [77]:
data1

   x2   x4
a  57  100
b  77  100
c  31  100

- ### 生成一列秩变量 即按照指定方法进行排序并返回一列元素的大小顺序的变量
    - method 
        - average
        - min、max
        - first
        - dense

In [78]:
data1.x2.rank(method="average",ascending=False) #降序

a    2.0
b    1.0
c    3.0
Name: x2, dtype: float64

In [80]:
data1.x2.rank(method='average',ascending=True) #升序

a    2.0
b    3.0
c    1.0
Name: x2, dtype: float64

In [81]:
data1.x2.rank(method='first',ascending=True)

a    2.0
b    3.0
c    1.0
Name: x2, dtype: float64

In [84]:
data1.x2.rank(method='dense',ascending=True)
data1

   x2   x4
a  57  100
b  77  100
c  31  100

 - ## ***根据一列原始数据生成一列新的数据***
     - ## 手写公式法
     - ## data1[''].map(lambda var : format range)

In [88]:
data1['x5']=data1['x2']**2

In [89]:
data1

   x2   x4    x5
a  57  100  3249
b  77  100  5929
c  31  100   961

In [90]:
data1['x6'] = data1['x2'].map(lambda x : x**2)
# lambda (var : format range)
# map(lambda(var : format range))

In [91]:
data1

   x2   x4    x5    x6
a  57  100  3249  3249
b  77  100  5929  5929
c  31  100   961   961

In [92]:
data1['x7']=[20,30,90]

- ## data.apply(lambda var:format f(x))

In [95]:
data1['max'] = data1.apply(lambda x: max(x['x2'],x['x7']),axis=1)

In [96]:
data1

   x2   x4    x5    x6  x7  max
a  57  100  3249  3249  20   57
b  77  100  5929  5929  30   77
c  31  100   961   961  90   90

- 实例小应用 apply

In [99]:
data1.apply(np.sum,axis=1)
# 每行进行求和

a     6732
b    12142
c     2233
dtype: int64

- ## 重命名

In [101]:
# 全部重新换列名
data1.rename(columns={'x2':'x1','x4':'x2','x5':'x3','x7':'x4'})

   x1   x2    x3    x6  x4  max
a  57  100  3249  3249  20   57
b  77  100  5929  5929  30   77
c  31  100   961   961  90   90

In [103]:
data1.drop(['x6'],axis=1)

   x2   x4    x5  x7  max
a  57  100  3249  20   57
b  77  100  5929  30   77
c  31  100   961  90   90

In [105]:
data1.drop(['x6'],axis=1,inplace=True)

In [106]:
data1

   x2   x4    x5  x7  max
a  57  100  3249  20   57
b  77  100  5929  30   77
c  31  100   961  90   90

In [107]:
data1.rename(columns={'x2':'x1',"x4":'x2','x5':'x3','x7':'x4'})

   x1   x2    x3  x4  max
a  57  100  3249  20   57
b  77  100  5929  30   77
c  31  100   961  90   90

- ## 数据框内容的导出

In [109]:
# 导入到当前路径
data1.to_csv('./shuju.csv')

In [110]:
# 不包含索引
data1.to_csv('ju.csv',index=False)